# Python打卡任务 / 打卡任务（更新至第四周）

<mark>Hello Python - 在 Anaconda 中打开 Jupyter Notebook，打印出 Hello Python

In [1]:
print('Hello Python')

Hello Python

<mark>import - 载入 numpy 及 pandas，并命名为 np 与 pd

In [2]:
import numpy as np
import pandas as pd

<mark>Series - 仿照示例创建包含如下元素的 Series 对象：2,4,6,8,10,np.nan

In [3]:
s = pd.Series([2,4,6,8,10,np.nan])#Series中可以有不同类型元素，这里因为np.nan是float类型，所以整个series的dtype也是float
s

0     2.0
1     4.0
2     6.0
3     8.0
4    10.0
5     NaN
dtype: float64

<mark>DataFrame - 按照示例创建 DataFrame 对象（两个）

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
#numpy.random.randn以给定的形状创建一个数组，数组元素来符合标准正态分布N(0,1) 
#若要获得一般正态分布N(μ,σ^2)则可用sigma * np.random.randn(…) + mu进行表示
#numpy.random.rand，同上，[0,1]之间均匀分布
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))#list('abcd')=['a','b','c','d']
df

                   A         B         C         D
2013-01-01  0.571674 -0.832200  0.436724 -1.922448
2013-01-02  1.929192 -1.094260 -0.280657  0.686523
2013-01-03  0.790240  1.275695  0.248599  1.627106
2013-01-04 -0.077763  0.740803  0.616785 -1.221960
2013-01-05  1.559055 -1.669104  0.086716 -1.483842
2013-01-06  0.389523  0.405137 -0.998078 -0.803660

In [6]:
#arrays must all be same length。
df2 = pd.DataFrame({'A': 1.,#等于df2['A']=2.0
                    'B': pd.Timestamp('20130102'),#等于df2['B']=pd.Timestamp'20130102'                    
                    #其中range()返回range类型，等差数列，在本行代码中去作用是确定Serie的长度，不能去掉
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),#list*4=list重复4次
                    #类别数据，有限取值，大量重复，可以理解为数据库的主从表或者内存指针，降低内存占用
                    #写法2：pd.Series(["test", "train", "test", "train"], dtype='category')
                    'E': pd.Categorical(["test", "train", "test", "train"]),                    
                    'F': 'foo'})#等于df2['F']='foo'
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

<mark>dtype - 按照示例查看 DataFrame 的数据类型<p>
<mark>TAB - 延续昨日的操作，在输入 df2. 后按下 tab 键（在键盘上数下第三行左一），会出现可供使用的函数。请使用此功能查看 df2 的 index。（提示：完整代码为 df2.index 。你可以输入 df2.in 之后按下 tab 键，在看到选择框后使用键盘上的方向键（在键盘右下区域）选择需要的函数，选中后按回车键） Viewing data

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

<mark>head - 仿照示例查看 df 前 4 行

In [8]:
df.head(4)#Number of rows to select.default 5

                   A         B         C         D
2013-01-01  0.571674 -0.832200  0.436724 -1.922448
2013-01-02  1.929192 -1.094260 -0.280657  0.686523
2013-01-03  0.790240  1.275695  0.248599  1.627106
2013-01-04 -0.077763  0.740803  0.616785 -1.221960

<mark>tail - 仿照示例查看 df 末 4 行

In [9]:
df.tail(4)

                   A         B         C         D
2013-01-03  0.790240  1.275695  0.248599  1.627106
2013-01-04 -0.077763  0.740803  0.616785 -1.221960
2013-01-05  1.559055 -1.669104  0.086716 -1.483842
2013-01-06  0.389523  0.405137 -0.998078 -0.803660

<mark>index - 按照示例查看 df 的 index

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

<mark>columns - 按照示例查看 df 的 columns

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

<mark>to_numpy - 按照示例将 df 转为 numpy 格式。请注意当列的数据类型不同时，to_numpy 的效率将变得很低。

In [12]:
df.to_numpy()

array([[ 0.57167425, -0.83219981,  0.43672443, -1.92244834],
       [ 1.92919183, -1.09426002, -0.28065719,  0.68652325],
       [ 0.79024024,  1.2756953 ,  0.24859886,  1.62710629],
       [-0.0777631 ,  0.74080267,  0.61678527, -1.2219603 ],
       [ 1.55905475, -1.66910402,  0.08671648, -1.48384203],
       [ 0.38952271,  0.40513713, -0.99807776, -0.80366014]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

<mark>describe - 按照示例查看 df 的描述性统计

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.860320 -0.195655  0.018348 -0.519714
std    0.751079  1.165033  0.585386  1.380929
min   -0.077763 -1.669104 -0.998078 -1.922448
25%    0.435061 -1.028745 -0.188814 -1.418372
50%    0.680957 -0.213531  0.167658 -1.012810
75%    1.366851  0.656886  0.389693  0.313977
max    1.929192  1.275695  0.616785  1.627106

<mark>T - 按照示例查看 df 的转置

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.571674    1.929192    0.790240   -0.077763    1.559055    0.389523
B   -0.832200   -1.094260    1.275695    0.740803   -1.669104    0.405137
C    0.436724   -0.280657    0.248599    0.616785    0.086716   -0.998078
D   -1.922448    0.686523    1.627106   -1.221960   -1.483842   -0.803660

<mark>sort_index - 仿照示例将 df 按照 index （日期）从近到远排列。

In [16]:
df.sort_index()

                   A         B         C         D
2013-01-01  0.571674 -0.832200  0.436724 -1.922448
2013-01-02  1.929192 -1.094260 -0.280657  0.686523
2013-01-03  0.790240  1.275695  0.248599  1.627106
2013-01-04 -0.077763  0.740803  0.616785 -1.221960
2013-01-05  1.559055 -1.669104  0.086716 -1.483842
2013-01-06  0.389523  0.405137 -0.998078 -0.803660

In [17]:
df.sort_index(axis=1, ascending=False)#默认0按index排序，1为按column，默认ascending=True正序，返回新对象，原df不变

                   D         C         B         A
2013-01-01 -1.922448  0.436724 -0.832200  0.571674
2013-01-02  0.686523 -0.280657 -1.094260  1.929192
2013-01-03  1.627106  0.248599  1.275695  0.790240
2013-01-04 -1.221960  0.616785  0.740803 -0.077763
2013-01-05 -1.483842  0.086716 -1.669104  1.559055
2013-01-06 -0.803660 -0.998078  0.405137  0.389523

<mark>sort_values - 仿照示例将 df 按照 A,B 两列从大到小排列。

In [18]:
#sort_index的by参数已经禁用，改为sort_values
#by接收str or list of str，不能为索引值
#返回新对象，原df不变
df.sort_values(by=['A','B'],ascending=False)

                   A         B         C         D
2013-01-02  1.929192 -1.094260 -0.280657  0.686523
2013-01-05  1.559055 -1.669104  0.086716 -1.483842
2013-01-03  0.790240  1.275695  0.248599  1.627106
2013-01-01  0.571674 -0.832200  0.436724 -1.922448
2013-01-06  0.389523  0.405137 -0.998078 -0.803660
2013-01-04 -0.077763  0.740803  0.616785 -1.221960

<mark>[] - 仿照示例获取 df 的 B 列（提示：英文单引号和英文双引号效果相同，选择一种使用即可）

In [19]:
df

                   A         B         C         D
2013-01-01  0.571674 -0.832200  0.436724 -1.922448
2013-01-02  1.929192 -1.094260 -0.280657  0.686523
2013-01-03  0.790240  1.275695  0.248599  1.627106
2013-01-04 -0.077763  0.740803  0.616785 -1.221960
2013-01-05  1.559055 -1.669104  0.086716 -1.483842
2013-01-06  0.389523  0.405137 -0.998078 -0.803660

In [20]:
df['B']#equivalent to df.A,[‘列名称’]，可以为list，不能为切片（切片为行），尽量还是用loc或者iloc吧，直接取值还是有点乱

2013-01-01   -0.832200
2013-01-02   -1.094260
2013-01-03    1.275695
2013-01-04    0.740803
2013-01-05   -1.669104
2013-01-06    0.405137
Freq: D, Name: B, dtype: float64

<mark>. - 仿照示例获取 df 的 C 列

In [21]:
df.C#效果同上，对于int类型的列名称，不能用df.列名称代替，只有字符串可以

2013-01-01    0.436724
2013-01-02   -0.280657
2013-01-03    0.248599
2013-01-04    0.616785
2013-01-05    0.086716
2013-01-06   -0.998078
Freq: D, Name: C, dtype: float64

<mark>[index_rank : index_rank] - 仿照示例查看 df 的 0 至 4 行（不含），也就是数学区间的[0,4)行

In [22]:
df[0:4]#行切片，数字代表序号，从0开始，选取index_rank时为前闭后开区间

                   A         B         C         D
2013-01-01  0.571674 -0.832200  0.436724 -1.922448
2013-01-02  1.929192 -1.094260 -0.280657  0.686523
2013-01-03  0.790240  1.275695  0.248599  1.627106
2013-01-04 -0.077763  0.740803  0.616785 -1.221960

<mark>[index_value : index_value] - 仿照示例查看 df 的 20130103 至 20130106（含），也就是数学区间的[20130103,20130106]行

In [23]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df[dates[2]:dates[5]]#行切片，选取index_value时为闭区间，如果index为int，不能采用此格式，会识别为序号

                   A         B         C         D
2013-01-03  0.790240  1.275695  0.248599  1.627106
2013-01-04 -0.077763  0.740803  0.616785 -1.221960
2013-01-05  1.559055 -1.669104  0.086716 -1.483842
2013-01-06  0.389523  0.405137 -0.998078 -0.803660

In [25]:
df['20130103':'20130106':2]

                   A         B         C         D
2013-01-03  0.790240  1.275695  0.248599  1.627106
2013-01-05  1.559055 -1.669104  0.086716 -1.483842

<mark>loc - 仿照示例获取 df 的 3 行，即 dates[3] 。(提示：index 的 label 为 date）

In [26]:
df.loc[dates[3]]#loc（index切片,column切片）,闭区间。只能用index和column，不能用序号，用序号是iloc

A   -0.077763
B    0.740803
C    0.616785
D   -1.221960
Name: 2013-01-04 00:00:00, dtype: float64

<mark>loc - 仿照示例获取 df 的 A,C 列。

In [27]:
df.loc[::2, ['A', 'C']]

                   A         C
2013-01-01  0.571674  0.436724
2013-01-03  0.790240  0.248599
2013-01-05  1.559055  0.086716

<mark>loc - 仿照示例获取 df 20130103 至 20130106 行的 A,C 列。

In [28]:
df.loc['20130103':'20130106', ['A', 'C']]

                   A         C
2013-01-03  0.790240  0.248599
2013-01-04 -0.077763  0.616785
2013-01-05  1.559055  0.086716
2013-01-06  0.389523 -0.998078

<mark>用法总结<p>
<mark>一般来说使用 loc 时，需要在方括号里填入行或列的 label，通俗地讲，就是行、列的名字。具体在本例中，就是 dates[3],20130103 (行的名字） 以及 A,C （列的名字）。<p>
<mark>如果我们把 index label 简写为 indexl，下标 i,j=0,1,……,N−1，N 为行数，且 i<j<p>
<mark>column label 简写为 columnl，下标 k,l=0,1,……,M−1，M 为列数，且 k<l<p>
<mark>那么对于连续的切片：<p>
<mark>df.loc[indexli:indexlj,columnlk:columnll]<p>
<mark>对于离散的切片：<p>
<mark>df.loc[[indexli,indexlj],[columnlk,columnll]]<p>
<mark>对于行连续、列离散的切片(行离散、列连续同理）：<p>
<mark>df.loc[indexli:indexlj,[columnlk,columnll]]
    
<mark><font color=red size=4 face=雅黑>loc为闭区间，iloc为左闭右开区间

<mark>at - 仿照示例获取 df 的 3 行 C 列

In [29]:
df.loc[dates[2], 'C']

0.24859885594911674

In [30]:
df.at[dates[2], 'C']#Similar to loc，据说速度快

0.24859885594911674

<mark>iloc - 仿照示例使用 iloc 获取 df 的 3 行

In [31]:
df.iloc[0:3]#loc（index切片,column切片）,只能用序号，左闭右开区间

                   A         B         C         D
2013-01-01  0.571674 -0.832200  0.436724 -1.922448
2013-01-02  1.929192 -1.094260 -0.280657  0.686523
2013-01-03  0.790240  1.275695  0.248599  1.627106

In [32]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.077763  0.740803
2013-01-05  1.559055 -1.669104

In [33]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.929192 -0.280657
2013-01-03  0.790240  0.248599
2013-01-05  1.559055  0.086716

In [34]:
df.iloc[1, 1]

-1.0942600246627285

In [35]:
df.iat[1, 1]#equivalent to the prior method

-1.0942600246627285

<mark>创建一个10行8列的随机数矩阵命名为 df3，其中列名为 ABCDEFGH

In [36]:
df3=pd.DataFrame(np.random.randn(10, 8),columns=list('ABCDEFGH'))
df3

,A,B,C,D,E,F,G,H
0,1.559225,-0.048947,0.137943,0.947202,-1.415298,-0.111825,-0.311688,1.491652
1,-0.254874,0.876602,-1.138701,-0.085680,-0.095247,-1.821507,-0.436848,0.201702
2,0.708727,0.657314,0.344676,0.023320,-0.365488,1.510449,3.164622,-0.513525
3,0.280762,0.055586,0.235312,0.227473,-1.348248,-0.475080,0.728777,0.268097
4,-0.773995,-0.135183,0.220046,-1.336325,-0.041316,-0.413270,-1.355229,-0.665385
5,-0.400092,0.618263,1.484914,-0.193890,0.738449,1.407031,0.789025,0.602891
6,0.121720,-3.219652,0.232913,-1.020645,0.278141,-1.262921,2.777659,0.130810
7,-0.310971,0.229454,-1.042809,0.919489,1.117301,-2.211824,0.472789,-1.898606
8,-1.377060,1.716090,0.223270,-1.180907,-0.799188,0.274992,1.233770,-0.941085
9,0.179066,-0.247512,0.690600,0.060033,0.921880,0.666343,-0.811199,1.530109

<mark>打印 df3 的前 5 行

In [37]:
df3.head()

,A,B,C,D,E,F,G,H
0,1.559225,-0.048947,0.137943,0.947202,-1.415298,-0.111825,-0.311688,1.491652
1,-0.254874,0.876602,-1.138701,-0.085680,-0.095247,-1.821507,-0.436848,0.201702
2,0.708727,0.657314,0.344676,0.023320,-0.365488,1.510449,3.164622,-0.513525
3,0.280762,0.055586,0.235312,0.227473,-1.348248,-0.475080,0.728777,0.268097
4,-0.773995,-0.135183,0.220046,-1.336325,-0.041316,-0.413270,-1.355229,-0.665385

<mark>查看 df3 的描述性统计

In [38]:
df3.describe()

,A,B,C,D,E,F,G,H
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,-0.026749,0.050202,0.138817,-0.163993,-0.100901,-0.243761,0.625168,0.020666
std,0.807543,1.291267,0.761505,0.802535,0.895854,1.264940,1.472109,1.067288
min,-1.377060,-3.219652,-1.138701,-1.336325,-1.415298,-2.211824,-1.355229,-1.898606
25%,-0.377812,-0.113624,0.158469,-0.813956,-0.690763,-1.065961,-0.405558,-0.627420
50%,-0.066577,0.142520,0.228091,-0.031180,-0.068281,-0.262548,0.600783,0.166256
75%,0.255338,0.647551,0.317335,0.185613,0.623372,0.568505,1.122584,0.519192
max,1.559225,1.716090,1.484914,0.947202,1.117301,1.510449,3.164622,1.530109

<mark>将 df3 按照 A 列数值从小到大排序（只展示前 5 行）

In [39]:
df3.sort_values(by='A').head()

,A,B,C,D,E,F,G,H
8,-1.377060,1.716090,0.223270,-1.180907,-0.799188,0.274992,1.233770,-0.941085
4,-0.773995,-0.135183,0.220046,-1.336325,-0.041316,-0.413270,-1.355229,-0.665385
5,-0.400092,0.618263,1.484914,-0.193890,0.738449,1.407031,0.789025,0.602891
7,-0.310971,0.229454,-1.042809,0.919489,1.117301,-2.211824,0.472789,-1.898606
1,-0.254874,0.876602,-1.138701,-0.085680,-0.095247,-1.821507,-0.436848,0.201702

<mark>打印 df3 的 C,H 列（只展示前 5 行）

In [40]:
df3.loc[0:4,['C','H']]

          C         H
0  0.137943  1.491652
1 -1.138701  0.201702
2  0.344676 -0.513525
3  0.235312  0.268097
4  0.220046 -0.665385

In [41]:
df3.iloc[0:5,[2,7]]

          C         H
0  0.137943  1.491652
1 -1.138701  0.201702
2  0.344676 -0.513525
3  0.235312  0.268097
4  0.220046 -0.665385

<mark>打印 df3 的 C 至 H 列（只展示前 5 行）

In [42]:
df3.loc[0:4,'C':'H']

          C         D         E         F         G         H
0  0.137943  0.947202 -1.415298 -0.111825 -0.311688  1.491652
1 -1.138701 -0.085680 -0.095247 -1.821507 -0.436848  0.201702
2  0.344676  0.023320 -0.365488  1.510449  3.164622 -0.513525
3  0.235312  0.227473 -1.348248 -0.475080  0.728777  0.268097
4  0.220046 -1.336325 -0.041316 -0.413270 -1.355229 -0.665385

In [43]:
df3.iloc[0:5,2:]

          C         D         E         F         G         H
0  0.137943  0.947202 -1.415298 -0.111825 -0.311688  1.491652
1 -1.138701 -0.085680 -0.095247 -1.821507 -0.436848  0.201702
2  0.344676  0.023320 -0.365488  1.510449  3.164622 -0.513525
3  0.235312  0.227473 -1.348248 -0.475080  0.728777  0.268097
4  0.220046 -1.336325 -0.041316 -0.413270 -1.355229 -0.665385

<mark>打印 df3 的 6,9 行

In [44]:
df3.loc[[6,9]]

,A,B,C,D,E,F,G,H
6,0.121720,-3.219652,0.232913,-1.020645,0.278141,-1.262921,2.777659,0.130810
9,0.179066,-0.247512,0.690600,0.060033,0.921880,0.666343,-0.811199,1.530109

In [45]:
df3.iloc[[6,9]]

,A,B,C,D,E,F,G,H
6,0.121720,-3.219652,0.232913,-1.020645,0.278141,-1.262921,2.777659,0.130810
9,0.179066,-0.247512,0.690600,0.060033,0.921880,0.666343,-0.811199,1.530109

<mark>打印 df3 的 6 至 9 行（不含）

In [46]:
df3.iloc[6:10]#注意为左闭右开区间

,A,B,C,D,E,F,G,H
6,0.121720,-3.219652,0.232913,-1.020645,0.278141,-1.262921,2.777659,0.130810
7,-0.310971,0.229454,-1.042809,0.919489,1.117301,-2.211824,0.472789,-1.898606
8,-1.377060,1.716090,0.223270,-1.180907,-0.799188,0.274992,1.233770,-0.941085
9,0.179066,-0.247512,0.690600,0.060033,0.921880,0.666343,-0.811199,1.530109

In [47]:
df3.loc[6:9]#注意为闭区间

,A,B,C,D,E,F,G,H
6,0.121720,-3.219652,0.232913,-1.020645,0.278141,-1.262921,2.777659,0.130810
7,-0.310971,0.229454,-1.042809,0.919489,1.117301,-2.211824,0.472789,-1.898606
8,-1.377060,1.716090,0.223270,-1.180907,-0.799188,0.274992,1.233770,-0.941085
9,0.179066,-0.247512,0.690600,0.060033,0.921880,0.666343,-0.811199,1.530109

<mark>打印 df3 的 6 至 9 行（不含）的 C 至 H 列

In [48]:
df3.iloc[6:9,2:]

          C         D         E         F         G         H
6  0.232913 -1.020645  0.278141 -1.262921  2.777659  0.130810
7 -1.042809  0.919489  1.117301 -2.211824  0.472789 -1.898606
8  0.223270 -1.180907 -0.799188  0.274992  1.233770 -0.941085

In [49]:
df3.loc[6:8,'C':'H']

          C         D         E         F         G         H
6  0.232913 -1.020645  0.278141 -1.262921  2.777659  0.130810
7 -1.042809  0.919489  1.117301 -2.211824  0.472789 -1.898606
8  0.223270 -1.180907 -0.799188  0.274992  1.233770 -0.941085

<mark>打印 df3 的 6,9 行的 C,H 列

In [50]:
df3.loc[[6,9],['C','H']]

          C         H
6  0.232913  0.130810
9  0.690600  1.530109

In [51]:
df3.iloc[[6,9],[2,7]]

          C         H
6  0.232913  0.130810
9  0.690600  1.530109

<mark>iloc - 仿照示例使用 iloc 获取 df 的 1 行至 4 行（不含）的 0 列至 3 列（不含）

In [52]:
df3.iloc[1:4,0:3]

          A         B         C
1 -0.254874  0.876602 -1.138701
2  0.708727  0.657314  0.344676
3  0.280762  0.055586  0.235312

<mark>iloc - 仿照示例使用 iloc 获取 df 的 1 行、 4 行的 0 列、 3 列

In [53]:
df3.iloc[[1,4],[0,3]]

          A         D
1 -0.254874 -0.085680
4 -0.773995 -1.336325

<mark>iloc - 仿照示例使用 iloc 获取 df 的 1 至 4 行（不含）

In [54]:
df3.iloc[1:4]

,A,B,C,D,E,F,G,H
1,-0.254874,0.876602,-1.138701,-0.085680,-0.095247,-1.821507,-0.436848,0.201702
2,0.708727,0.657314,0.344676,0.023320,-0.365488,1.510449,3.164622,-0.513525
3,0.280762,0.055586,0.235312,0.227473,-1.348248,-0.475080,0.728777,0.268097

<mark>iloc - 仿照示例使用 iloc 获取 df 的 2 行 2 列

In [55]:
df3.iloc[2,2]

0.3446764417000618

<mark>iat - 仿照示例使用 iat 获取 df 的 2 行 2 列

In [56]:
df3.iat[2,2]

0.3446764417000618

<mark>仿照示例选取 df 中 A 列大于 0.5 的部分

In [57]:
df3[df3.A>.5]

,A,B,C,D,E,F,G,H
0,1.559225,-0.048947,0.137943,0.947202,-1.415298,-0.111825,-0.311688,1.491652
2,0.708727,0.657314,0.344676,0.023320,-0.365488,1.510449,3.164622,-0.513525

<mark>仿照示例选取 df 中所有小于 0.5 的部分

In [58]:
df3[df3<.5]

,A,B,C,D,E,F,G,H
0,NaN,-0.048947,0.137943,NaN,-1.415298,-0.111825,-0.311688,NaN
1,-0.254874,NaN,-1.138701,-0.085680,-0.095247,-1.821507,-0.436848,0.201702
2,NaN,NaN,0.344676,0.023320,-0.365488,NaN,NaN,-0.513525
3,0.280762,0.055586,0.235312,0.227473,-1.348248,-0.475080,NaN,0.268097
4,-0.773995,-0.135183,0.220046,-1.336325,-0.041316,-0.413270,-1.355229,-0.665385
5,-0.400092,NaN,NaN,-0.193890,NaN,NaN,NaN,NaN
6,0.121720,-3.219652,0.232913,-1.020645,0.278141,-1.262921,NaN,0.130810
7,-0.310971,0.229454,-1.042809,NaN,NaN,-2.211824,0.472789,-1.898606
8,-1.377060,NaN,0.223270,-1.180907,-0.799188,0.274992,NaN,-0.941085
9,0.179066,-0.247512,NaN,0.060033,NaN,NaN,-0.811199,NaN

<mark><font color=red size=4 face=雅黑>从下面代码块开始，df、df2均被覆盖

<mark>创建 df :
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [59]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.573588  0.142956 -0.385871  0.725706
2013-01-02 -0.161212  2.003575 -0.014554  1.122852
2013-01-03 -0.646614 -2.817714 -0.499927  0.572079
2013-01-04 -1.130273 -1.545320 -0.338461 -1.013032
2013-01-05 -0.816211  2.454490  1.375652  1.388656
2013-01-06  0.075114  0.059730  1.475762 -0.688870

<mark>copy - 按照示例复制 df 并命名为 df2

In [60]:
#df2=df是对原df的引用
#df2=df.copy()是复制，a new object will be created
#默认deep=True，deep=False的时候就相当于df2=df
df2=df.copy()
df2

                   A         B         C         D
2013-01-01 -1.573588  0.142956 -0.385871  0.725706
2013-01-02 -0.161212  2.003575 -0.014554  1.122852
2013-01-03 -0.646614 -2.817714 -0.499927  0.572079
2013-01-04 -1.130273 -1.545320 -0.338461 -1.013032
2013-01-05 -0.816211  2.454490  1.375652  1.388656
2013-01-06  0.075114  0.059730  1.475762 -0.688870

<mark>仿照示例创建 df2 的 E 列，值为 ['T', 'O', 'T', 'T', 'D', 'U']

In [61]:
df2['E'] = ['T', 'O', 'T', 'T', 'D', 'U']#没有的时候是创建，有的时候是赋值
df2

                   A         B         C         D  E
2013-01-01 -1.573588  0.142956 -0.385871  0.725706  T
2013-01-02 -0.161212  2.003575 -0.014554  1.122852  O
2013-01-03 -0.646614 -2.817714 -0.499927  0.572079  T
2013-01-04 -1.130273 -1.545320 -0.338461 -1.013032  T
2013-01-05 -0.816211  2.454490  1.375652  1.388656  D
2013-01-06  0.075114  0.059730  1.475762 -0.688870  U

<mark>isin - 仿照示例选取 df2 中 E 列值为 T,D,U 的部分

In [62]:
df2[df2.E.isin(['T','D','U'])]

                   A         B         C         D  E
2013-01-01 -1.573588  0.142956 -0.385871  0.725706  T
2013-01-03 -0.646614 -2.817714 -0.499927  0.572079  T
2013-01-04 -1.130273 -1.545320 -0.338461 -1.013032  T
2013-01-05 -0.816211  2.454490  1.375652  1.388656  D
2013-01-06  0.075114  0.059730  1.475762 -0.688870  U

<mark>仿照示例创建 s1，长度为 7，数值任意，其中 index 为 20200206 起的 7 天

In [63]:
s1 = pd.Series(list(range(1,8)), index=pd.date_range('20200206', periods=7))#list(range(1,8))==[1, 2, 3, 4, 5, 6,7]
s1

2020-02-06    1
2020-02-07    2
2020-02-08    3
2020-02-09    4
2020-02-10    5
2020-02-11    6
2020-02-12    7
Freq: D, dtype: int64

<mark>at - 仿照示例将 df 的 0 行 B 列赋值为 0

In [64]:
df.at['20130101','B']=0
df

                   A         B         C         D
2013-01-01 -1.573588  0.000000 -0.385871  0.725706
2013-01-02 -0.161212  2.003575 -0.014554  1.122852
2013-01-03 -0.646614 -2.817714 -0.499927  0.572079
2013-01-04 -1.130273 -1.545320 -0.338461 -1.013032
2013-01-05 -0.816211  2.454490  1.375652  1.388656
2013-01-06  0.075114  0.059730  1.475762 -0.688870

<mark>iat - 仿照示例将 df 的 0 行 0 列赋值为 0

In [65]:
df.iat[0,0]=0
df

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.385871  0.725706
2013-01-02 -0.161212  2.003575 -0.014554  1.122852
2013-01-03 -0.646614 -2.817714 -0.499927  0.572079
2013-01-04 -1.130273 -1.545320 -0.338461 -1.013032
2013-01-05 -0.816211  2.454490  1.375652  1.388656
2013-01-06  0.075114  0.059730  1.475762 -0.688870

<mark>将 df 的 D 列均赋值为 5

In [66]:
df.D=5
df.loc[:,'D']=5#效果同上，逗号前面的冒号不能省略
df.iloc[:,3]=np.array([5] * len(df))#效果同上，Python len() 方法返回对象（字符、列表、元组等）长度或项目个数。=df.shape[0]
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.385871  5
2013-01-02 -0.161212  2.003575 -0.014554  5
2013-01-03 -0.646614 -2.817714 -0.499927  5
2013-01-04 -1.130273 -1.545320 -0.338461  5
2013-01-05 -0.816211  2.454490  1.375652  5
2013-01-06  0.075114  0.059730  1.475762  5

<mark>仿照示例将 df 中数值为 5 的赋值为其相反数

In [67]:
df[df==5]=-df
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.385871 -5
2013-01-02 -0.161212  2.003575 -0.014554 -5
2013-01-03 -0.646614 -2.817714 -0.499927 -5
2013-01-04 -1.130273 -1.545320 -0.338461 -5
2013-01-05 -0.816211  2.454490  1.375652 -5
2013-01-06  0.075114  0.059730  1.475762 -5

<mark>按照示例创建 df1

In [68]:
#Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.
#df.columns是index对象， + ['E']是遍历data加，list(df.columns) + ['E']是延长
#df.columns.tolist()也ok
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D   E
2013-01-01  0.000000  0.000000 -0.385871 -5 NaN
2013-01-02 -0.161212  2.003575 -0.014554 -5 NaN
2013-01-03 -0.646614 -2.817714 -0.499927 -5 NaN
2013-01-04 -1.130273 -1.545320 -0.338461 -5 NaN

<mark>按照示例给 E 列 0,1 行赋值为 1

In [69]:
df1.iloc[[0,1],4]=1#等同于：df1.loc[dates[0]:dates[1], 'E'] = 1或df1.iloc[0:2,4]
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.385871 -5  1.0
2013-01-02 -0.161212  2.003575 -0.014554 -5  1.0
2013-01-03 -0.646614 -2.817714 -0.499927 -5  NaN
2013-01-04 -1.130273 -1.545320 -0.338461 -5  NaN

<mark>dropna - 按照示例对 df1 去除所有含有空值的行

In [70]:
#默认返回副本，不改变原dataframe
#inplacebool, default False，If True, do operation inplace and return None.
#how{‘any’, ‘all’}, default ‘any’
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.385871 -5  1.0
2013-01-02 -0.161212  2.003575 -0.014554 -5  1.0

<mark>fillna - 按照示例将 df1 中所有空值用数值 5 填充

In [71]:
#默认返回副本，不改变原dataframe
#inplacebool, default False，If True, do operation inplace and return None.
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.385871 -5  1.0
2013-01-02 -0.161212  2.003575 -0.014554 -5  1.0
2013-01-03 -0.646614 -2.817714 -0.499927 -5  5.0
2013-01-04 -1.130273 -1.545320 -0.338461 -5  5.0

<mark>isna - 按照示例判断 df1 中每个值是否为空值

In [72]:
df1.isna()

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

<mark>mean - 按照示例计算 df 每一列的平均值

In [73]:
df.mean()

A   -0.446533
B    0.025793
C    0.268767
D   -5.000000
dtype: float64

<mark>mean - 按照示例计算 df 每一行的平均值

In [74]:
df.mean(1)

2013-01-01   -1.346468
2013-01-02   -0.793048
2013-01-03   -2.241064
2013-01-04   -2.003514
2013-01-05   -0.496517
2013-01-06   -0.847349
Freq: D, dtype: float64

<mark>shift - 按照示例创建 s 并后移 2 行

In [75]:
#shift(periods=1, freq改变的是时间索引（如果有）=None, axis=0, fill_value=None)
#freq改变的是时间索引（如果有）
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

<mark>sub - 按照示例将 df 每一列与 s 相减

In [76]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.385871 -5
2013-01-02 -0.161212  2.003575 -0.014554 -5
2013-01-03 -0.646614 -2.817714 -0.499927 -5
2013-01-04 -1.130273 -1.545320 -0.338461 -5
2013-01-05 -0.816211  2.454490  1.375652 -5
2013-01-06  0.075114  0.059730  1.475762 -5

In [77]:
df.sub(s, axis='index')#For Series input, axis to match Series index on.注意df和s的index需要类型和值都相同

                   A         B         C     D
2013-01-01       NaN       NaN       NaN   NaN
2013-01-02       NaN       NaN       NaN   NaN
2013-01-03 -1.646614 -3.817714 -1.499927  -6.0
2013-01-04 -4.130273 -4.545320 -3.338461  -8.0
2013-01-05 -5.816211 -2.545510 -3.624348 -10.0
2013-01-06       NaN       NaN       NaN   NaN

<mark>apply & cumsum - 按照示例对 df 每一列执行累加

In [78]:
#axis{0 or ‘index’, 1 or ‘columns’}, default 0
#接收function为参数
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000 -0.385871  -5
2013-01-02 -0.161212  2.003575 -0.400425 -10
2013-01-03 -0.807826 -0.814139 -0.900352 -15
2013-01-04 -1.938099 -2.359460 -1.238813 -20
2013-01-05 -2.754310  0.095030  0.136839 -25
2013-01-06 -2.679196  0.154760  1.612601 -30

<mark>apply & cumsum - 仿照示例对 df 每一行执行累加

In [79]:
df.apply(np.cumsum,axis=1)

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.385871 -5.385871
2013-01-02 -0.161212  1.842363  1.827809 -3.172191
2013-01-03 -0.646614 -3.464329 -3.964255 -8.964255
2013-01-04 -1.130273 -2.675593 -3.014055 -8.014055
2013-01-05 -0.816211  1.638279  3.013932 -1.986068
2013-01-06  0.075114  0.134844  1.610606 -3.389394

<mark>apply & lambda - 按照示例对 df 每一列求极差

In [80]:
df.apply(lambda x: x.max() - x.min())#关注lambda函数

A    1.205386
B    5.272204
C    1.975688
D    0.000000
dtype: float64

<mark>按照示例创建 s

In [81]:
s = pd.Series(np.random.randint(0, 7, size=10))#Return random integers from `low` (inclusive) to `high` (exclusive).from均匀分布
s

0    1
1    1
2    4
3    6
4    2
5    6
6    5
7    5
8    6
9    6
dtype: int32

<mark>value_counts - 统计 s 中各个数值出现的频次

In [82]:
s.value_counts()

6    4
5    2
1    2
4    1
2    1
dtype: int64

<mark>按照示例创建 s

In [83]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

<mark>str.lower - 按照示例将 s 中元素的字母都变为小写

In [84]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

<mark>str.upper - 仿照示例将 s 中元素的字母都变为大写

In [85]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

<mark>str.capitalize - 仿照示例将 s 中元素的首字母变为大写

In [86]:
s.str.capitalize()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    Caba
7     Dog
8     Cat
dtype: object

<mark>Merge
Concat
按照示例创建 df</mark>

In [87]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.437725 -0.054247  0.550346 -0.056704
1  1.366455  0.303706  0.536089  0.524999
2 -0.757277 -0.329649 -1.883398  0.756779
3  0.649073  1.157531  0.723258 -0.106236
4  0.536351 -1.095750  0.583111  0.804208
5  1.177075  1.398464 -0.058811 -1.185875
6 -0.276659 -0.974131  0.435056 -0.249776
7 -0.855638 -0.759469 -1.158062 -1.129400
8  1.544392  0.732822  0.375282 -0.137196
9 -1.143701  2.360066 -0.661125  0.124113

<mark>按照示例将 df 切成三份

In [88]:
pieces = [df[:3], df[3:7], df[7:]]#分别是：012行、3456行、789行
print(df[:3])
print(df[3:7])
print(df[7:])

          0         1         2         3
0 -0.437725 -0.054247  0.550346 -0.056704
1  1.366455  0.303706  0.536089  0.524999
2 -0.757277 -0.329649 -1.883398  0.756779
          0         1         2         3
3  0.649073  1.157531  0.723258 -0.106236
4  0.536351 -1.095750  0.583111  0.804208
5  1.177075  1.398464 -0.058811 -1.185875
6 -0.276659 -0.974131  0.435056 -0.249776
          0         1         2         3
7 -0.855638 -0.759469 -1.158062 -1.129400
8  1.544392  0.732822  0.375282 -0.137196
9 -1.143701  2.360066 -0.661125  0.124113

<mark>concat - 按照示例将切割后的 pieces 拼接起来(关于函数更详尽的解释见官方文档)

In [89]:
pd.concat(pieces)#axis=0,join='outer',默认外连接，不区分左外右外，左右需要单独处理

          0         1         2         3
0 -0.437725 -0.054247  0.550346 -0.056704
1  1.366455  0.303706  0.536089  0.524999
2 -0.757277 -0.329649 -1.883398  0.756779
3  0.649073  1.157531  0.723258 -0.106236
4  0.536351 -1.095750  0.583111  0.804208
5  1.177075  1.398464 -0.058811 -1.185875
6 -0.276659 -0.974131  0.435056 -0.249776
7 -0.855638 -0.759469 -1.158062 -1.129400
8  1.544392  0.732822  0.375282 -0.137196
9 -1.143701  2.360066 -0.661125  0.124113

<mark>仿照示例将 df 按列切成三份，每一份分别拥有1、2、1列

In [90]:
pieces2=[df.iloc[:,[0]],df.iloc[:,[1,2]],df.iloc[:,[-1]]]
print(df.iloc[:,[0]])
print(df.iloc[:,[1,2]])
print(df.iloc[:,[-1]])

          0
0 -0.437725
1  1.366455
2 -0.757277
3  0.649073
4  0.536351
5  1.177075
6 -0.276659
7 -0.855638
8  1.544392
9 -1.143701
          1         2
0 -0.054247  0.550346
1  0.303706  0.536089
2 -0.329649 -1.883398
3  1.157531  0.723258
4 -1.095750  0.583111
5  1.398464 -0.058811
6 -0.974131  0.435056
7 -0.759469 -1.158062
8  0.732822  0.375282
9  2.360066 -0.661125
          3
0 -0.056704
1  0.524999
2  0.756779
3 -0.106236
4  0.804208
5 -1.185875
6 -0.249776
7 -1.129400
8 -0.137196
9  0.124113

<mark>concat - 仿照示例将按列切割后的拼接起来(关于函数更详尽的解释见官方文档)

In [91]:
pd.concat(pieces2,axis=1)

          0         1         2         3
0 -0.437725 -0.054247  0.550346 -0.056704
1  1.366455  0.303706  0.536089  0.524999
2 -0.757277 -0.329649 -1.883398  0.756779
3  0.649073  1.157531  0.723258 -0.106236
4  0.536351 -1.095750  0.583111  0.804208
5  1.177075  1.398464 -0.058811 -1.185875
6 -0.276659 -0.974131  0.435056 -0.249776
7 -0.855638 -0.759469 -1.158062 -1.129400
8  1.544392  0.732822  0.375282 -0.137196
9 -1.143701  2.360066 -0.661125  0.124113

<mark>Merge
Join按照示例创建数据框 left 和 right</mark>

In [92]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
print(left)
print(right)

   key  lval
0  foo     1
1  foo     2
   key  rval
0  foo     4
1  foo     5

<mark>merge - 按照示例以 key 为主键合并 left 和 right(关于函数更详尽的解释见官方文档)

In [93]:
#on:指定连接键，如果不指定，自动用左右交集作为连接键
#how: One of 'left', 'right', 'outer', 'inner'. Defaults to inner.
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

<mark>按照示例创建数据框 left 和 right

In [94]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
print(left)
print(right)

   key  lval
0  foo     1
1  bar     2
   key  rval
0  foo     4
1  bar     5

<mark>merge - 按照示例以 key 为主键合并 left 和 right(关于函数更详尽的解释见官方文档)

In [95]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

<mark>Grouping
按照示例创建数据框 df

In [96]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.451054  1.622528
1  bar    one -0.135580 -0.929697
2  foo    two  2.078534  0.380728
3  bar  three  0.226133 -0.963478
4  foo    two  1.227150 -0.139053
5  bar    two -0.177644  0.425916
6  foo    one  1.450999  1.513440
7  foo  three  0.855827  0.142531

<mark>groupby & sum - 按照示例将 df 按 A 列分组对有数值的列求和

In [97]:
df.groupby('A').sum()

            C         D
A
bar -0.087090 -1.467259
foo  4.161456  3.520173

<mark>groupby & sum - 按照示例将 df 按 A,B 列分组对有数值的列求和

In [98]:
df.groupby(['A', 'B']).sum()#df.groupby(['A', 'B']).agg(sum)

                  C         D
A   B
bar one   -0.135580 -0.929697
    three  0.226133 -0.963478
    two   -0.177644  0.425916
foo one   -0.000054  3.135968
    three  0.855827  0.142531
    two    3.305684  0.241675

<mark>groupby & sum - 仿照示例将 df 按 A 列分组对 C 列求和

In [99]:
df.groupby('A').agg({'C':'sum'})#df.groupby().agg({列名:函数名,列名:函数名})

            C
A
bar -0.087090
foo  4.161456

In [100]:
df.groupby('A')['C'].sum()#同上

A
bar   -0.087090
foo    4.161456
Name: C, dtype: float64

<mark>groupby & mean - 仿照示例将 df 按 B 列分组对 D 列求平均

In [101]:
df.groupby('B').agg({'D':'mean'})

              D
B
one    0.735424
three -0.410473
two    0.222530

<mark>Reshaping
Stack
按照示例创建 tuples 和 index 并打印显示</mark>

In [102]:
#这种写法太麻烦了，在参数为list时，zip和*zip是效果相同的，只有当参数是zip类型对象时用*zip解压才有意义
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [103]:
#建议用下面这种写法，虽然结果一样，但是这种比较好理解
tuples = list(zip(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                  ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [104]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [105]:
#如果对每一个元素都进行迭代的话，最顺的办法是不用zip转换再转换，直接用from_product
iterables = [['bar', 'baz', 'foo', 'qux'], ['one', 'two']]
index = pd.MultiIndex.from_product(iterables, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

<mark>按照示例创建 df、df2 并打印显示

In [106]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -2.448343  0.279573
      two    -0.777919 -1.106198
baz   one     0.572658 -0.126185
      two     1.307399 -0.236034
foo   one     0.441952  0.505582
      two    -0.936522  0.605908
qux   one    -0.020688 -1.132808
      two    -1.775495 -0.558316

In [107]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -2.448343  0.279573
      two    -0.777919 -1.106198
baz   one     0.572658 -0.126185
      two     1.307399 -0.236034

<mark>stack - 按照示例对 df2 进行堆叠

In [108]:
#stack操作后将列索引number旋转为行索引，并且置于行索引的最内层（外层为索引state），也就是将旋转轴（number）的结果置于最低级别
stacked = df2.stack()
stacked

first  second
bar    one     A   -2.448343
               B    0.279573
       two     A   -0.777919
               B   -1.106198
baz    one     A    0.572658
               B   -0.126185
       two     A    1.307399
               B   -0.236034
dtype: float64

<mark>unstack - 按照示例对数据框 stack 进行去堆叠
<p><mark>unstack - 按照示例对数据框 stack 按 level = 1 进行去堆叠(提示：数据框 stack 共有三层 index，分别为 first,second,A/B, 对应 level 0,1,2)
<p><mark>unstack - 按照示例对数据框 stack 按 level = 0 进行去堆叠
<p><mark>unstack - 仿照示例对数据框 stack 按 level = 2进行去堆叠(提示：数据框 stack A/B 这个 index 的 level 为 2，同时，由于它在 index 中排在最末，也可表示为 level = -1。unstack 默认 level 参数为 -1)

In [109]:
#unstack操作默认将内层行索引number旋转为列索引。同时，也可以指定分层级别或者索引名称来指定操作级别
stacked.unstack()

                     A         B
first second
bar   one    -2.448343  0.279573
      two    -0.777919 -1.106198
baz   one     0.572658 -0.126185
      two     1.307399 -0.236034

In [110]:
stacked.unstack(1)#最外侧是0

second        one       two
first
bar   A -2.448343 -0.777919
      B  0.279573 -1.106198
baz   A  0.572658  1.307399
      B -0.126185 -0.236034

In [111]:
stacked.unstack(0)

first          bar       baz
second
one    A -2.448343  0.572658
       B  0.279573 -0.126185
two    A -0.777919  1.307399
       B -1.106198 -0.236034

In [112]:
stacked.unstack(2)
stacked.unstack(-1)#同上
stacked.unstack()#同上

                     A         B
first second
bar   one    -2.448343  0.279573
      two    -0.777919 -1.106198
baz   one     0.572658 -0.126185
      two     1.307399 -0.236034

<mark>Reshaping
Pivot tables
按照示例创建 df 并打印显示</mark>

In [113]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.299000 -0.519769
1     one  B  foo -0.287779  2.838982
2     two  C  foo  0.547219 -1.720053
3   three  A  bar -0.936810 -0.296975
4     one  B  bar -2.746837 -0.220455
5     one  C  bar -0.862854 -0.625256
6     two  A  foo -1.933614  0.106892
7   three  B  foo -1.494173  1.338958
8     one  C  foo -0.813152  1.107292
9     one  A  bar  0.039609 -3.141321
10    two  B  bar -1.511452  0.607936
11  three  C  bar -1.830921  0.507563

<mark>pivot_table - 按照示例创建 df 的数据透视表
![](https://pbpython.com/images/pivot-table-datasheet.png)

In [114]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.039609 -0.299000
      B -2.746837 -0.287779
      C -0.862854 -0.813152
three A -0.936810       NaN
      B       NaN -1.494173
      C -1.830921       NaN
two   A       NaN -1.933614
      B -1.511452       NaN
      C       NaN  0.547219

In [115]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'],aggfunc={'D':np.sum},margins=True)

C             bar       foo        All
A     B
one   A  0.039609 -0.299000  -0.259391
      B -2.746837 -0.287779  -3.034616
      C -0.862854 -0.813152  -1.676006
three A -0.936810       NaN  -0.936810
      B       NaN -1.494173  -1.494173
      C -1.830921       NaN  -1.830921
two   A       NaN -1.933614  -1.933614
      B -1.511452       NaN  -1.511452
      C       NaN  0.547219   0.547219
All     -7.849264 -4.280501 -12.129764

<mark>Time series
date_range - 按照示例创建以时间序列 rng 为 index 的随机数数据框 ts
<p><mark>freq取值列表看https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries-offset-aliases

In [116]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng[:10]

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09'],
              dtype='datetime64[ns]', freq='S')

<mark>resample & sum - 仿照示例对 ts 按 30S 进行重采样并求和

In [117]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample('30S').sum()#降采样默认为左闭右开区间closed='left'，label='left'

2012-01-01 00:00:00    8143
2012-01-01 00:00:30    6763
2012-01-01 00:01:00    7518
2012-01-01 00:01:30    2376
Freq: 30S, dtype: int32

<mark>date_range - 按照示例创建以时间序列 rng 为 index 的随机数数据框 ts

In [118]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    0.265234
2012-03-07   -0.157692
2012-03-08    1.647037
2012-03-09   -0.532214
2012-03-10    2.062198
Freq: D, dtype: float64

<mark>tz_localize - 按照示例将 ts 索引上的时间序列设定为 UTC 时间

In [119]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    0.265234
2012-03-07 00:00:00+00:00   -0.157692
2012-03-08 00:00:00+00:00    1.647037
2012-03-09 00:00:00+00:00   -0.532214
2012-03-10 00:00:00+00:00    2.062198
Freq: D, dtype: float64

 <mark>tz_convert - 按照示例将 ts_utc 索引上的时间从 UTC 时间转为美国东部时间

In [120]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.265234
2012-03-06 19:00:00-05:00   -0.157692
2012-03-07 19:00:00-05:00    1.647037
2012-03-08 19:00:00-05:00   -0.532214
2012-03-09 19:00:00-05:00    2.062198
Freq: D, dtype: float64

<mark>Time series
date_range - 按照示例创建以时间序列 rng 为 index 的随机数数据框 ts</mark>

In [121]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31    0.887464
2012-02-29   -0.935110
2012-03-31   -0.532403
2012-04-30   -0.804094
2012-05-31   -1.110844
Freq: M, dtype: float64

<mark>to_period - 按照示例将数据框 ts 的时间戳索引转为时期索引

In [122]:
ps = ts.to_period()
ps

2012-01    0.887464
2012-02   -0.935110
2012-03   -0.532403
2012-04   -0.804094
2012-05   -1.110844
Freq: M, dtype: float64

<mark>to_period - 仿照示例将数据框 ts 的时间戳索引转为以季度为时期的索引(提示：freq='Q')

In [123]:
ps=ts.to_period(freq='Q')
ps

2012Q1    0.887464
2012Q1   -0.935110
2012Q1   -0.532403
2012Q2   -0.804094
2012Q2   -1.110844
Freq: Q-DEC, dtype: float64

<mark>to_period - 仿照示例将数据框 ts 的时间戳索引转为以年为时期的索引

In [124]:
ps=ts.to_period(freq='Y')
ps

2012    0.887464
2012   -0.935110
2012   -0.532403
2012   -0.804094
2012   -1.110844
Freq: A-DEC, dtype: float64

<mark>to_timestamp - 按照示例将数据框 ps 的时期索引转为时间戳索引

In [125]:
ps.to_timestamp()#转为以年为时期的索引后精度丢失

2012-01-01    0.887464
2012-01-01   -0.935110
2012-01-01   -0.532403
2012-01-01   -0.804094
2012-01-01   -1.110844
dtype: float64

<mark>period_range - 按照示例创建以时间序列 prng 为 index 的随机数数据框 ts 
    <p><mark>打印 prng

In [126]:
#许多季度型数据会涉及“财年末”的概念，通常是一年12个月中某月的最后一个工作日或日历日。
#因此，时间“2012Q4”根据财年末的不同会有不同的含义。pandas支持12种可能的季度型频率，即Q-JAN到Q-DEC。
#因为本例中“财年末”为11月，所以1990Q1的起始月为1989年的12月
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
prng

PeriodIndex(['1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
             '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
             '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
             '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
             '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
             '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
             '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
             '2000Q3', '2000Q4'],
            dtype='period[Q-NOV]', freq='Q-NOV')

<mark>asfreq - 将 prng 转为以月为频率的时间序列，返回值为每个季度的结束月(提示：比如 Q1 为 1月至3月，则 Q1 的起始月为1月，最末月为3月。参数 how = 'start' 表示选择起始期返回，how = 'end' 表示选择最末期返回，它们可直接缩写为 's', 'e')

In [127]:
#注意，本例中Q1不是1月至3月，题干有错误，参照上一个代码块的说明
ts.index = prng.asfreq('M', 'e')
ts.head()

1990-02    1.242954
1990-05   -1.997743
1990-08   -0.606100
1990-11    0.348564
1991-02   -0.030541
Freq: M, dtype: float64

<mark>asfreq - 仿照示例将 prng 转为以月为频率的时间序列，返回值为每个季度的结束月，并在此基础上增加一个月

In [128]:
ts.index = prng.asfreq('M', 'e') + 1
ts.head()

1990-03    1.242954
1990-06   -1.997743
1990-09   -0.606100
1990-12    0.348564
1991-03   -0.030541
Freq: M, dtype: float64

<mark>asfreq - 仿照示例将 prng 转为以月为频率的时间序列，返回值为每个季度的结束月，并在此基础上增加一个月，然后将其转换为以小时为频率的时间序列，返回值为每天的起始小时，并在此基础上增加 10 个小时

In [129]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 10
ts.head()

1990-03-01 10:00    1.242954
1990-06-01 10:00   -1.997743
1990-09-01 10:00   -0.606100
1990-12-01 10:00    0.348564
1991-03-01 10:00   -0.030541
Freq: H, dtype: float64